def area(a, b):
    '''
    Возвращает площадь прямоугольника данных размеров.

        Параметры:
            a (float) - ширина прямоугольника
            b (float) - высота прямоугольника
        
        Возвращаемое значение:
            area (float) - площадь прямоугольника
    ''' 
    return a * b 

def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника данных размеров.

        Параметры:
            a (float) - ширина прямоугольника
            b (float) - высота прямоугольника
        
        Возвращаемое значение:
            perimeter (float) - периметр прямоугольника
    ''' 
    return (a + b) * 2